# -*- coding: utf-8 -*-

require 'date'

books=[
  [  
    "実践アジャイル ソフトウェア開発法とプロジェクト管理",
   "山田正樹",
   "やまだまさき",
   "ソフトウェアリサーチセンター",
   248,
   2500,
   2650,
   "4883732088",
   "978-4883732081",
   "12 x 14.8 x 2",
   Date.new(2005,1,25),
   Date.new(2005,2,2),
  ],

  [
    "入門LEGO MINDSTORM NXT レゴブロックで動くロボット",
    "大庭慎一郎",
    "おおばしんいちろう",
    "ソフトバンククリエイティブ",
    164,
    2400,
    2520,
    "4797338253",
    "98-4797338256",
    "23 x 18.2 x 1.6",
    Date.new(2006,12,23),
    Date.new(2007,1,10),
  ]
]

books.each{|fp|
  puts "--------------"
  puts "書籍名: #{fp[0]}"
  puts "著者名: #{fp[1]}"
  puts "よみがな: #{fp[2]}"
  puts "出版社: #{fp[3]}"
  puts "ページ数: #{fp[4]} ページ"
  puts "販売価格: #{fp[5]} 円"
  puts "購入費用: #{fp[6]} 円"
  puts "ISBN_10: #{fp[7]}"
  puts "ISBN_13: #{fp[8]}"
  puts "寸法: #{fp[9]}"
  puts "発刊日: #{fp[10]}"
  puts "購入日: #{fp[11]}"
}